Tekla Open API Reference for Tekla Structures 2025
ProfileItem.GetProfileItemSubTypes Method (ProfileItem, ProfileItem.ProfileItemTypeEnum)
[Missing <summary> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes(Tekla.Structures.Catalogs.ProfileItem,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)"]
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<ProfileItemSubType> GetProfileItemSubTypes(
	ProfileItem profileItem,
	ProfileItem.ProfileItemTypeEnum typeEnum
)
Public Shared Function GetProfileItemSubTypes (
	profileItem As ProfileItem,
	typeEnum As ProfileItem.ProfileItemTypeEnum
) As List(Of ProfileItemSubType)
Parameters
profileItem
Type: Tekla.Structures.Catalogs.ProfileItem
[Missing <param name="profileItem"/> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes(Tekla.Structures.Catalogs.ProfileItem,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)"]
typeEnum
Type: Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum
[Missing <param name="typeEnum"/> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes(Tekla.Structures.Catalogs.ProfileItem,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)"]
Return Value
Type: List<ProfileItemSubType>
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes(Tekla.Structures.Catalogs.ProfileItem,Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)"]
See Also
Reference
ProfileItem Class
GetProfileItemSubTypes Overload
Tekla.Structures.Catalogs Namespace